Couldn't generate surfaces for ramp.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotGenerateRampError { get; }
  Visual Basic
Public Shared ReadOnly Property CannotGenerateRampError As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotGenerateRampError {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures StairRampFailures Class
  Autodesk.Revit.DB Namespace